Revit 2027 API
ParameterTypeId.StairsRailingHeightShiftVal Property
 "Landing Height Adjustment"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsRailingHeightShiftVal { get; }
Public Shared ReadOnly Property StairsRailingHeightShiftVal As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsRailingHeightShiftVal {
	ForgeTypeId^ get ();
}
static member StairsRailingHeightShiftVal : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace